Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: མཚན་ཉིད་མེད་པའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །རབ་འབྱོར་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཚན་ཉིད་མེད་པའི་ཆོས་རྣམས་ལ་གནས་ཤིང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པ་གཉིས་ཀྱིས་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: Subhūti, if you ask how bodhisattva great beings complete the perfection of tolerance while maintaining attributes that are without defining characteristics, in this regard, Subhūti, bodhisattva great beings complete the perfection of tolerance through two modes of tolerance.

source: གཉིས་གང་ཞེ་ན། ཉམས་སུ་ལེན་པའི་བཟོད་པ་དང་། ཆོས་ཁོངས་སུ་ཆུད་པའི་བཟོད་པའོ། །དེ་ལ་ཉམས་སུ་ལེན་པའི་བཟོད་པ་གང་ཞེ་ན། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དྲུང་དུ་གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་ཡང་དང་ཡང་འོངས་ཤིང་། གཤེ་བ་འམ། མི་སྙན་པར་བརྗོད་ཅིང་།
en: If you ask what these two are, they comprise the tolerance of the experience [of suffering] and the tolerance that understands phenomena.

source: མ་ཀླས་པའི་ཚིག་བརླང་པོ་ཟེར་བར་གྱུར་ཏམ། རྡོ་དབྱིག་དང་། མཚོན་ཆས་བརྡེགས་སམ། བཏབ་ཀྱང་། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འདོད་པས།
en: If you ask what is the tolerance of the experience [of suffering], this implies that, starting from the time when they first begin to set their mind on enlightenment until they are seated at the site of enlightenment, even if all beings were to approach those bodhisattva great beings and reprimand them, or rebuke them with unpleasant words and speak mendacious and harsh words, or strike or beat them with clods of earth, clubs, and weapons, seeking to complete the perfection of tolerance, these bodhisattva great beings would not have even the slightest thought imbued with anger or malice.

source: སེམས་བསྐྱེད་པ་འགའ་ཙམ་ཡང་འཁྲུག་པ་དང་ལྡན་པ་འམ། གནོད་སེམས་དང་ལྡན་པ་བསྐྱེད་པར་མི་བྱ་སྟེ། ཕྱིར་སེམས་ཅན་དེ་དག་ལ་ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ཉོན་མོངས་པའི་ནད་ཀྱིས་མནར་བ་སྟེ།
en: But they should above all cultivate compassion for those beings, thinking, ‘Alas, these beings are tormented by the ailments of afflicted mental states.

source: འདི་དག་ལ་བདག་གིས་སྡིག་ཏོའི་སེམས་མི་བསྐྱེད་ཀྱི་འདི་ནི་བདག་ཉིད་ཀྱིས་ཕུང་པོ་དགྲར་གྱུར་པ་འདི་རྣམས་བླངས་པའི་ལེན་ཏོ་ཞེས་དེ་དག་ལྷག་པར་སྙིང་རྗེ་བསྐྱེད་པར་བྱའོ།
en: I should not have negative thoughts toward them. Rather, I should accept them because I have accepted those psycho-physical aggregates that are inimical.’

source: །བྱམས་པ་དང་ལྡན་ཏེ། སྙིང་རྗེ་བར་གྱུར་ནས། རྣམ་པ་དེ་ལྟར་རྟོག་པ་འདི་ནི་ཉམས་སུ་ལེན་པའི་བཟོད་པ་ཞེས་བྱའོ།
en: Imbued with loving kindness and resorting to compassion, such reflections are called the tolerance of the experience [of suffering]. “

source: །དེ་ལ་ཆོས་ཁོངས་སུ་ཆུད་པའི་བཟོད་པ་གང་ཞེ་ན། སེམས་ཅན་དེ་དག་ཀྱང་དོན་དམ་པར་དམིགས་སུ་མེད་ན། བདག་ལ་གཤེ་བ་འམ། མི་སྙན་པར་བརྗོད་པ་འམ། མ་ཀླས་པའི་ཚིག་བརླང་པོ་ཟེར་བ་འམ།
en: If you ask what is the tolerance that understands phenomena, since even those beings are ultimately nonapprehensible, [bodhisattvas] should think, ‘Who is scolding me, reprimanding me with unpleasant words, or speaking mendacious and harsh words?

source: རྡོ་དབྱིག་གིས་རྡེག་ཅིང་མཚོན་འདེབས་པ་ལྟ་སུ་ཞིག་ཡོད་དེ།
en: Who is beating me with clods and clubs, or striking me with weapons?

source: འདུ་བྱེད་ཐམས་ཅད་ནི་སྒྱུ་མ་ལྟ་བུ། གསོབ། གསོག །རག་ལས་པ།
en: All formative predispositions are illusion-like.

source: ནམ་མཁའ་ལྟ་བུ། བདག་དང་སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་།
en: They are hollow, void, vacuous, and like space.

source: སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་བྲལ་བ་སྟེ།
en: They are without self, any sentient beings, life forms, living beings, life, living creatures, individual personalities, human beings, or persons.

source: རྣམ་པར་རྟོག་པ་དེ་དག་ཐམས་ཅད་ནི་ཡོངས་སུ་རྟོག་པ་ལས་བྱུང་བ་ཡིན་ན། བདག་ལ་གཤེ་བ་དང་། མི་སྙན་པར་བརྗོད་པ་དང་། མ་ཀླས་པའི་ཚིག་བརླང་པོ་ཟེར་བ་དང་།
en: Since all these conceptual thoughts derive from imagination, who is scolding me, reprimanding me with unpleasant words, or speaking mendacious and harsh words?

source: རྡོ་དབྱིག་གིས་རྡེག་ཅིང་མཚོན་གྱིས་འདེབས་པ་ལྟ་བུ་ཞིག་ཡོད་དེ།
en: Who is beating me with clods and clubs, or striking me with weapons?

source: །བདག་གི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དང་། དོན་དམ་པ་སྟོང་པ་ཉིད་ཉེ་བར་བཟུང་སྟེ།
en: Owing to the emptiness of essential nature and owing to the emptiness of ultimate reality, I should not conceptualize in these ways.’

source: དེ་ལྟར་རྣམ་པར་བརྟག་པར་མི་བྱའོ་ཞེས་བྱ་བ་འདི་ནི་ཆོས་ཁོང་དུ་ཆུད་པའི་བཟོད་པ་ཞེས་བྱ་སྟེ།
en: This is called the tolerance that understands phenomena.

source: དེ་དེ་ལྟར་ཡོངས་སུ་རྟོག་ཅིང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: Reflecting in that manner, they perfect the perfection of tolerance.

source: དེ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པ་དེས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ།
en: Those who have perfected the perfection of tolerance attain the acceptance that phenomena are nonarising.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཞེས་བགྱི་བ་ནི་གང་ལགས།
en: Then Subhūti asked, “Blessed Lord, what is the acceptance that phenomena are nonarising?

source: དེ་སྤངས་པ་ནི་ཅི་མཆིས།
en: What is its extent?

source: ཡེ་ཤེས་ནི་ཅི་མཆིས།
en: What is its cognition?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཆོས་གང་ལ་རྡུལ་ཙམ་ཡང་སྐྱེ་བ་མེད་པ་དེ་ནི་མི་སྐྱེ་བའོ།
en: Subhūti,” replied the Blessed One, “not even the slightest phenomena arise—this denotes nonarising.

source: །དེ་གང་གིས་ཤེས་པ་དེ་ནི་བཟོད་པ་ཞེས་བྱ་བ་སྟེ།
en: Acceptance is said to be that through which it is cognized.

source: ཤེས་པ་དེས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ།
en: Through this cognition, they acquire the acceptance that phenomena are nonarising.” {

source: བཅོམ་ལྡན་འདས་ཉན་ཐོས་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་གང་ལགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་གང་ལགས་པའི་བཟོད་པ་དེ་དག་ལ་བྱེ་བྲག་ཏུ་བགྱི་བ་ཅི་མཆིས།
en: VII: 34} “Blessed Lord, what are the distinctions between the acceptance that śrāvakas and pratyekabuddhas have with respect to [the truth] that phenomena are nonarising, and the acceptance that bodhisattvas have with respect to [the truth] that phenomena are nonarising?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་རྒྱུན་དུ་ཞུགས་པའི་ཤེས་པ་གང་ཡིན་པ་དང་། སྤོང་བ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའོ།
en: Subhūti,” replied the Blessed One, “the acceptance of bodhisattva great beings includes the cognition and correct exertion of those who enter the stream to nirvāṇa.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་ཤེས་པ་གང་ཡིན་པ་དང་། སྤོང་བ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའོ།
en: The acceptance of bodhisattva great beings includes the cognition and correct exertion of those who are destined for only one more rebirth.

source: །ཕྱིར་མི་འོང་བའི་ཤེས་པ་གང་ཡིན་པ་དང་། སྤོང་བ་གང་ཡིན་པ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའོ།
en: The acceptance of bodhisattva great beings includes the cognition and correct exertion of those who are no longer subject to rebirth.

source: །དགྲ་བཅོམ་པའི་ཤེས་པ་གང་ཡིན་པ་དང་། སྤོང་བ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའོ།
en: The acceptance of the bodhisattva great beings includes the cognition and correct exertion of those who are arhats.

source: །རང་སངས་རྒྱས་ཀྱི་ཤེས་པ་གང་ཡིན་པ་དང་། སྤོང་བ་གང་ཡིན་པ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པ་སྟེ།
en: The acceptance of bodhisattva great beings includes the cognition and correct exertion of those who are pratyekabuddhas.

source: རབ་འབྱོར་དེ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་བཟོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པའི་བྱེ་བྲག་ཡིན་ནོ།
en: This then is the distinction between the acceptance of the śrāvakas and pratyekabuddhas, and the acceptance of the bodhisattvas. “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བཟོད་པ་དེ་ལྟ་བུ་དང་ལྡན་པས། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏེ།
en: Subhūti, bodhisattva great beings who possess such acceptance surpass all the śrāvakas and pratyekabuddhas.

source: དེ་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ལ་གནས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལ་སྤྱོད་ཅིང་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: Abiding in this acceptance that phenomena are nonarising, which derives from the maturation [of past actions], they practice the path of the bodhisattvas, and perfect the knowledge of the path.

source: དེ་ཡོངས་སུ་རྫོགས་པས། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་རྣམས་དང་མི་འབྲལ་བ་ཡིན།
en: By perfecting this, they will not lack the thirty-seven factors conducive to enlightenment, or the meditative stabilities of emptiness, signlessness, and wishlessness.

source: དེ་མངོན་པར་ཤེས་པ་ལྔ་དང་མི་འབྲལ་བ་ཡིན། དེ་མངོན་པར་ཤེས་པ་རྣམས་དང་མི་འབྲལ་བས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ཡིན། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་པ་ཡིན།
en: They will not lack the five extrasensory powers, and since they will not lack the five extrasensory powers, they will bring beings to maturation, and refine the buddhafields.

source: དེ་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས་ནས། སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དེ།
en: Having brought beings to maturation and refined the buddhafields, they will attain all-aspect omniscience through the wisdom of a single instant.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མཚན་ཉིད་མེད་པའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: So it is, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, they will perfect the perfection of tolerance, which is without defining characteristics. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྨི་ལམ་ལྟ་བུའི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་གནས། སྒྲ་བརྙན་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they exert physical and mental perseverance, while abiding in the five acquisitive psycho-physical aggregates that are dreamlike, and abiding in the five acquisitive psycho-physical aggregates that are like an echo, like an optical aberration, like a magical display, like a mirage, and like a phantom.

source: སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུའི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་གནས་ཤིང་། ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་རྩོམ་མོ། །དེ་ལུས་ཀྱི་བརྩོན་འགྲུས་ཀྱིས་རྫུ་འཕྲུལ་མངོན་པར་བསྒྲུབས་ཏེ།
en: Through physical perseverance, they actualize miraculous abilities; {Ki.

source: ཕྱོགས་དང་ཕྱོགས་མཚམས་ཐམས་ཅད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དག་ཏུ་སོང་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བྱེད་ཅིང་། སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དོ།
en: VII: 35} traversing the world systems of all the cardinal and intermediate directions, they act for the sake of beings and refine the buddhafields.

source: །དེ་ལུས་ཀྱི་བརྩོན་འགྲུས་དེས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་ནས། ཐེག་པ་གསུམ་ལ་འཛུད་ཅིང་རབ་ཏུ་འགོད་དེ།
en: Through physical perseverance, they will bring beings to maturation, encourage them to engage in the three vehicles, and establish them in those vehicles.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མཚན་ཉིད་མེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །དེ་སེམས་ཀྱི་བརྩོན་འགྲུས་ཟག་པ་མེད་པ་ལམ་གྱི་ཡན་ལག་ཏུ་གྱུར་པ་ལམ་གྱི་ཁོངས་སུ་ཆུད་པས། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་དུ་དགེ་བའི་ཆོས་ཐམས་ཅད་འདི་ལྟ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་།
en: So it is, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, they will perfect the perfection of tolerance, which is without defining characteristics. “

source: སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་འདུས་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: One who possesses mental perseverance, which is included within the path and the branches of the path free from contaminants, will perfect the integration of all the following virtuous attributes: the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the three gateways to liberation, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: །དེ་ལ་སྤྱོད་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། དེ་ཡོངས་སུ་རྫོགས་པས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་སྤང་བར་འགྱུར་རོ།
en: Practicing in that manner, bodhisattva great beings will perfect all-aspect omniscience, and by perfecting that, they will abandon all the connecting propensities.

source: །བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་སྤངས་ནས། མཚན་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ཀུན་ཏུ་སྣང་བར་ཐོབ་པར་བྱས་ནས། ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པ་བཅུ་གཉིས་རྒྱུད་གསུམ་དུ་བསྐོར་བར་འགྱུར་རོ།
en: Having abandoned all the connecting propensities, they will perfect the excellent major marks, and after acquiring an aureole, they will turn the wheel of the Dharma, in the three times and in its twelve aspects.

source: །དེ་བསྐོར་བས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པ་དྲུག་ཏུ་གཡོ་བ་དང་། རབ་ཏུ་གཡོ་བ་དང་། ཀུན་ནས་གཡོ་བ་དང་། འགུལ་བ་དང་། རབ་ཏུ་འགུལ་བ་དང་།
en: Through this turning [of the wheel], the world systems of the great trichiliocosm will shake, shudder, and judder in six ways; they will rock, reel, and totter, and they will quiver, careen, and convulse. “

source: ཀུན་ནས་འགུལ་བ་དང་། ལྡེག་པ་དང་། རབ་ཏུ་ལྡེག་པ་དང་། ཀུན་ནས་ལྡེག་པར་འགྱུར་ཏེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱང་སྣང་བ་ཆེན་པོས་རྒྱས་པར་གང་བར་འགྱུར་རོ།
en: All world systems of the great trichiliocosm will also be permeated with great luminosity.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེའི་སྒྲ་གང་དུ་བྱུང་ཞིང་དབྱངས་གྲག་པར་གྱུར་པའི་སྒྲ་དེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི། སེམས་ཅན་གང་ཇི་སྙེད་ཀྱི་ཐོས་པ།
en: The words of the tathāgatas, arhats, completely awakened buddhas, wherever they arise and their intonation resonates, will be heard by all those beings who are present in the world systems of the great trichiliocosm.

source: དེ་ཐམས་ཅད་ཐེག་པ་གསུམ་ལ་ངེས་པར་འགྱུར་ཏེ།
en: All of them will attain emancipation through the three vehicles.

source: རབ་འབྱོར་དེ་ལྟར་ཕན་པ་ཆེན་པོ་དང་ལྡན་པ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Subhūti, this perfection of perseverance that bodhisattva great beings have is endowed with such great benefits.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱའོ།
en: Abiding in the perfection of perseverance, bodhisattva great beings will perfect all the attributes of the buddhas and attain all-aspect omniscience. “

source: སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུའི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན་ཞེ་ན།
en: VII: 36} and like a phantom.

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །བྱམས་པ་དང་།
en: If you ask why, in this regard, Subhūti, those bodhisattva great beings who practice the perfection of wisdom will achieve and maintain the first meditative concentration, and then they will achieve and maintain the second meditative concentration, the third meditative concentration, and the fourth meditative concentration.

source: སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་།
en: They will also achieve and maintain loving kindness, compassion, empathetic joy, and equanimity, and they will achieve and maintain [the formless absorptions in] the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception.

source: ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་སྒོམ་མོ།
en: They will cultivate the meditative stabilities of emptiness, signlessness, and wishlessness.

source: །གློག་ལྟ་བུའི་ཏིང་ངེ་འཛིན་སྒོམ་མོ། །ཡང་དག་པའི་ཏིང་ངེ་འཛིན་སྒོམ་མོ།
en: They will cultivate the meditative stability that resembles lightning.

source: །རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་གནས་ཤིང་།
en: They will cultivate the authentic meditative stability.

source: དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་མ་གཏོགས་པར། ཉན་ཐོས་དང་། ཐུན་མོང་བ་འམ། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གང་ཇི་སྙེད་པ་དང་། གཞན་ཡང་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པའི་ཚོགས་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ལུས་ཀྱིས་ཁྱབ་པར་བྱས་ཤིང་།
en: With the exception of dwelling in the vajra-like meditative stability and [attaining] the meditative stabilities of the tathāgatas, they will also achieve and maintain all the meditative stabilities of the śrāvakas and pratyekabuddhas, and any other categories of meditative stability and meditative absorption, their bodies permeated with them all.

source: ཉེ་བར་བསྒྲུབས་ཏེ་གནས་ཀྱང་། ཏིང་ངེ་འཛིན་དེ་དག་དང་སྙོམས་པར་འཇུག་པའི་འབྲས་བུའི་རོ་ཡང་མྱོང་བར་མི་བྱེད་དོ།
en: But they will not relish these meditative stabilities or the fruits of these meditative absorptions.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་དེ་དག་གི །མཚན་ཉིད་མེད་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་ཤེས་པས་ན། མཚན་ཉིད་མེད་པའི་ཆོས།
en: If you ask why, it is because bodhisattva great beings understand that these meditative stabilities are without defining characteristics and have an essential nature of nonentity.

source: མཚན་ཉིད་མེད་པའི་ཆོས་ཀྱིས་རོ་མྱོང་བར་བྱེད་པར་ཡང་ག་ལ་འགྱུར། དངོས་པོ་མེད་པའི་ཆོས་ཀྱང་།
en: So how could anything without defining characteristics possibly relish an attribute that is without defining characteristics!

source: དངོས་པོ་མེད་པའི་ཆོས་ཀྱིས་རོ་མྱོང་བར་བྱེད་པར་ག་ལ་འགྱུར་ཏེ།
en: How could anything that is a nonentity possibly relish something that is a nonentity!

source: དེ་རོ་མྱོང་བར་བྱེད་པ་མེད་པས། ཏིང་ངེ་འཛིན་གང་གི་དབང་གིས་ཀྱང་གཟུགས་ཀྱི་ཁམས་སམ། གཟུགས་མེད་པའི་ཁམས་སུ་སྐྱེ་བར་མི་འགྱུར་རོ།
en: Since they do not relish anything, they will not be reborn through the power of these meditative stabilities in the realm of form or in the realm of formlessness.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་ཁམས་དེ་གཉིས་ཀྱང་མི་དམིགས། གང་སྙོམས་པར་འཇུག་པ་དང་། གང་གིས་སྙོམས་པར་འཇུག་པར་ཡང་མི་དམིགས་སོ།
en: If you ask why, it is because they do not even apprehend those two realms, nor do they apprehend anyone entering into absorption, nor anything by which they would enter into absorption.

source: །དེ་མི་དམིགས་པས་མཚན་ཉིད་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Since all phenomena are nonapprehensible, they will complete the perfection of meditative stability that is without defining characteristics.

source: །ཏིང་ངེ་འཛིན་གྱིས་ཕ་རོལ་དུ་ཕྱིན་པ་དེས། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་ཡོངས་སུ་འདའོ།
en: Through this perfection of meditative stability, they will transcend the levels of the śrāvakas and the pratyekabuddhas.” “

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིས་ཤིང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་ཡོངས་སུ་འདའ་བ་ལགས།
en: Blessed Lord, how do bodhisattva great beings complete the perfection of meditative stability and transcend the levels of the śrāvakas and the pratyekabuddhas?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནང་སྟོང་པ་ཉིད་ལ་ཤིན་ཏུ་བསླབས་པ་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་ཤིན་ཏུ་བསླབས་པའི་ཕྱིར་ཏེ།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings have been well trained in the emptiness of internal phenomena, and they have been well trained in the emptiness of external phenomena, the emptiness of external and internal phenomena, and in [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: སྟོང་པ་ཉིད་འདི་དག་ལ་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་འམ་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་འམ། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་འམ། དགྲ་བཅོམ་པ་ཉིད་དམ། རང་བྱང་ཆུབ་འམ། གང་ལ་གནས་པར་བྱ་བའི་ཆོས་དེ་ལྟ་བུ་གང་ཡང་མི་དམིགས་ཏེ།
en: So, with respect to these aspects of emptiness, they do not apprehend anything at all that would attain the fruit of entering the stream to nirvāṇa, or the fruit of being destined for only one more rebirth, or the fruit of no longer being subject to rebirth, or arhatship, or individual enlightenment, or anything in which they should dwell.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་བ་དེ་ཡང་སྟོང་པ་ཉིད་རྣམས་ཀྱིས་སྟོང་སྟེ།
en: All-aspect omniscience, too, is empty of these aspects of emptiness.

source: སྟོང་པ་ཉིད་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་ཤིན་ཏུ་འདས་ནས།
en: Through these aspects of emptiness, they will absolutely transcend the levels of the śrāvakas and the pratyekabuddhas, {Ki.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་གོ །
en: VII: 37} and enter a bodhisattva’s full maturity.” “

source: གསོལ་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་ནི་གང་ལགས། སྐྱོན་མ་མཆིས་པ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what is the immaturity of bodhisattva great beings, and what is the maturity of the bodhisattvas?” “

source: རབ་འབྱོར་དམྱིགས་པ་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་ནོ།
en: Subhūti, all apprehending constitutes the immaturity of bodhisattva great beings.

source: །མི་དམིགས་པ་ཐམས་ཅད་ནི་སྐྱོན་མེད་པའོ། །གསོལ་པ།
en: All nonapprehension constitutes their maturity,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་དམིགས་པ་ནི་གང་ལགས།
en: Blessed Lord, what is apprehending?

source: མི་དམིགས་པ་ནི་གང་ལགས།
en: What is the nonapprehension?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གཟུགས་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དམིགས་པའོ།
en: Subhūti,” replied the Blessed One, “physical forms constitute apprehending for bodhisattva great beings.

source: །རབ་འབྱོར་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དམིགས་པའོ།
en: Subhūti, feelings, perceptions, formative predispositions, and consciousness constitute apprehending for bodhisattva great beings.

source: །མིག་དང་གཟུགས་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དམིགས་པའོ།
en: The eyes and sights constitute apprehending for bodhisattva great beings.

source: །རྣ་བ་དང་སྒྲ་དང་། སྣ་དང་དྲི་དང་། ལྕེ་དང་རོ་དང་། ལུས་དང་རེག་བྱ་དང་། ཡིད་དང་ཆོས་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དམིགས་པའོ།
en: The ears and sounds, the nose and odors, the tongue and tastes, the body and tangibles, and the mental faculty and mental phenomena constitute apprehending for bodhisattva great beings.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ནི་དམིགས་པའོ།
en: Visual consciousness, visually compounded sensory contact, and feelings conditioned by visually compounded sensory contact constitute apprehending.
